src/Documents/СписаниеРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеРасход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>AccumulationRegister.ТекущиеДолги</xr:Item>
				<xr:Item>AccumulationRegister.Бюджет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходовДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиНаСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Расходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Расходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходовДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходовДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцБюджета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/СписаниеРасход/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
 Блокировка = Новый БлокировкаДанных;
 ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНаСчетах");
 ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
 ЭлементБлокировки.УстановитьЗначение("Счет", СчетСписания);
 Блокировка.Заблокировать();
 ЗапросОстатка = Новый Запрос;
 ЗапросОстатка.Текст = 
  "ВЫБРАТЬ
  | ОстаткиНаСчетахОстатки.СуммаОстаток КАК СуммаОстаток
  |ИЗ
  | РегистрНакопления.ОстаткиНаСчетах.Остатки(, Счет = &СчетСписания) КАК ОстаткиНаСчетахОстатки"; 
 ЗапросОстатка.УстановитьПараметр("СчетСписания", СчетСписания); 
 РезультатОстатка = ЗапросОстатка.Выполнить();
 ВыборкаОстатка = РезультатОстатка.Выбрать(); 
 ТекущийОстаток = 0; 
 Если ВыборкаОстатка.Следующий() Тогда
  Если ВыборкаОстатка.СуммаОстаток <> Неопределено И ВыборкаОстатка.СуммаОстаток <> Null Тогда
   ТекущийОстаток = ВыборкаОстатка.СуммаОстаток;
  КонецЕсли;
 КонецЕсли; 
 Если ТекущийОстаток < Сумма Тогда
  Отказ = Истина;
  Сообщить("Недостаточно средств на счете! Доступно: " + ТекущийОстаток + ", попытка списать: " + Сумма);
  Возврат;
 КонецЕсли;
 Движения.ОстаткиНаСчетах.Записывать = Истина;
 ДвижениеСчет = Движения.ОстаткиНаСчетах.Добавить();
 ДвижениеСчет.ВидДвижения = ВидДвиженияНакопления.Расход;
 ДвижениеСчет.Период = Дата;
 ДвижениеСчет.Счет = СчетСписания;
 ДвижениеСчет.Сумма = Сумма; 
 Движения.Расходы.Записывать = Истина;
 ДвижениеРасход = Движения.Расходы.Добавить();
 ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Приход;
 ДвижениеРасход.Период = Дата;
 ДвижениеРасход.Категория = КатегорияРасхода;
 ДвижениеРасход.Сумма = Сумма;
 Движения.Бюджет.Записывать = Истина;
 ДвижениеБюджет = Движения.Бюджет.Добавить();
 ДвижениеБюджет.Период = Дата;
 ДвижениеБюджет.МесяцБюджета = НачалоМесяца(Дата); 
 ДвижениеБюджет.Категория = КатегорияРасхода;
 ДвижениеБюджет.Лимит = 0;
 ДвижениеБюджет.Использовано = Сумма;
 НачПериода = НачалоМесяца(Дата);
 КонПериода = КонецМесяца(Дата); 
 ЗапросБюджет = Новый Запрос;
 ЗапросБюджет.Текст = 
  "ВЫБРАТЬ
  | ЕСТЬNULL(БюджетОбороты.ЛимитОборот, 0) КАК Лимит,
  | ЕСТЬNULL(БюджетОбороты.ИспользованоОборот, 0) КАК Использовано
  |ИЗ
  | РегистрНакопления.Бюджет.Обороты(&НачПериода, &КонПериода, , Категория = &Категория И МесяцБюджета = &МесяцБюджета) КАК БюджетОбороты";  
 ЗапросБюджет.УстановитьПараметр("НачПериода", НачПериода);
 ЗапросБюджет.УстановитьПараметр("КонПериода", КонПериода);
 ЗапросБюджет.УстановитьПараметр("Категория", КатегорияРасхода);
 ЗапросБюджет.УстановитьПараметр("МесяцБюджета", НачПериода); 
 РезультатБюджет = ЗапросБюджет.Выполнить().Выбрать();
 ЛимитБюджета = 0;
 ФактТрат = Сумма; 
 Если РезультатБюджет.Следующий() Тогда
  ЛимитБюджета = РезультатБюджет.Лимит;
  ФактТрат = ФактТрат + РезультатБюджет.Использовано;
 КонецЕсли;
 Сообщить("[ОТЛАДКА] Лимит в базе: " + ЛимитБюджета + " | Всего факта с учетом этого документа: " + ФактТрат); 
 Если ЛимитБюджета > 0 И ФактТрат > ЛимитБюджета Тогда
  ПревышениеЧисление = ФактТрат - ЛимитБюджета;
  Сообщение = Новый СообщениеПользователю;
  Сообщение.Текст = "Внимание! Лимит по категории '" + КатегорияРасхода + "' превышен на " + ПревышениеЧисление + " руб. Расход учтен.";
  Сообщение.Сообщить();
 КонецЕсли; 
КонецПроцедуры
